// **************** level1

let str = "JavaScript";
let letter = str[1]; 
console.log(letter);
// вертає 'a'
// [1] після  str вказує на символ під індексом 1 з відліком від 0. В даному рядку на другому місці знаходиться літера а

let text = "Джаваскріпт - це весело";
let length = text.length;
console.log(length);
// вертає 23
// length вертає загальну кількість символів у рядку

var result = 0/0;
console.log(nan)
// вертає ReferenceError: nan is not defined. 
// по-перше, маємо виводити в консоль result, змінна nan не визначена
// по-друге, NaN спеціальне значення, яке є попередньо визначеним саме в такому форматі написання

var guessWho = 3.14;
guessWho = 'А тепер тут строка';
guessWho = false;
guessWho = 9.14;
console.log(guessWho)
// вертає 9.14
// після кожного знаку = після змінної guessWho значення в цій змінній перезаписується. в консоль лог ми бачимо останнє записане значення для цієї змінної 

const num = 42;
const str1 = "Shuba";
const result = num + str1; 
console.log(result)
// вертає 42Shuba
// під час конкатенації число 42 прирівнюється до рядку та приєднується до рядку "Shuba"

var result = "40" - 4;
console.log(result);
// вертає 36
// математична операція віднімання відбувається лише для чисел, тож JavaScript пробує перевести рядок в число і виконує віднімання

// **************** level2 

let n = 7;
n *= 9 + 1;
console.log(n);
// виводить 70
// спочатку відбувається дія додавання 9 і 1, потім змінна n помножується на результат додавання і перезаписується

var a = 4;
var b = 3;
var c = a = b;
console.log(c)
// вертає 3
// значення змінної a прирівнюється до змінної b і стає 3. далі значення змінної с прирівнюється до а і також стає 3
// всі три змінні вертатимуть 3

var number = 65;
number %= 2;
console.log(number);
// вертає 1
// оператор залишку від ділення, не розумію як працює, треба почитати. сподіваюсь не частий у використанні оператор 
// upd: розказали як працює, поняв

console.log(17 !== '17');
// вертає true
// операто суворої рівності з знаком ! вазує на нерівність двох значень. в даному випадку число 17 не дорівнює рядку "17", тому вертає true

console.log((+null));
// вертає 0
// оператор + перед null прирівнює null до числа, null завжди = 0

// **************** level3

// Який буде результат?
let sex = 'male';
let birthday = 19;
let discount;
if (sex === 'male'){
    discount = (birthday >= 25 ) ? "30%" : "10%";
} else if (sex === 'female'){
    discount = (birthday === 19) ? "30%" : "10%";
} else {
    discount = (birthday === 7) ? "10%" : "5%";
} 
console.log(discount)
// вертає 10%
// виконується умова першого if. якщо sex = 'male' та birthday >= 25, discount = 30%, але в даному випадку birthday = 19, тому discount = 10%

// Який буде результат?
let firstName = "";
let lastName = "Bulochka";
let nickName = "";
console.log( firstName || lastName || nickName || "Анонім"); 
//  вертає Bulochka
// оператор || (або) вертає перше значння із вказаних, яке є правдивим

// Який буде результат?
console.log( null || (2 && 3) || 4 ); 
// вертає 3
// ??? таке тіки загугливши вирішу, оце перше правдиве/останнє неправдиве все ще тяжко дається

// Яке буде останнє значення?
var i = 0;
do {
    i += 3;
    console.log("i = " + i);
} while (i < 8);
// останнє значення i = 9
// в межах циклу do виконується дія додавання числа 3 до і та перезаписування результату у змінну і. і ця дія виконуватиметься поки умова while не стане false

// **************** level4

/* Завдання 1:
Вирахуйте значення площі кола на основі наданих значень.
Площа кола дорівню добутку квадрату радіуса на число Пі(3.1415)
Виведіть результат 
*/

var r = 15; // радіус
var Pi = 3.1415; // число Пі

var square = r ** 2 * Pi;
console.log(square)

// вертає 706.8375000000001
// відповідно до формули розрахунку площі кола радіус зводиться в 2 степінь і результат множиться на число Пі


/* Завдання 2:
Виведіть на екран загальну вартість всіх продуктів, які є на складі
 */

let productPrice1 = 101.5; // ціна 1го продукту
let productPrice2 = 50.25; // ціна 2го продукту
let productPrice3 = 10.11; // ціна 3го продукту

let productQuantity1 = 5;  // кількість одениць 1го продукту на складі 
let productQuantity2 = 9;  // кількість одениць 2го продукту на складі 
let productQuantity3 = 15; // кількість одениць 3го продукту на складі 

let total = (productPrice1 * productQuantity1) + (productPrice2 * productQuantity2) + (productPrice3 * productQuantity3);
console.log(total);

// вертає 1111.4
// множенням в дужках ми отримуємо загальну вартість продуктів певного типу. потім додаємо все меж собою

/* Завдання 3:
Змініть if...else на switch. 
Поведінка сценарія, після зміни, повинно залишитись без змін (зверніть увагу на змінні USA и Great Britain). 
*/

var country = prompt("Введіть назву країни");

switch (country) {
    case country == "USA":
    case country == "Great Britain":
        alert("Англійська мова");
        break;
    case country == "Germany":
        alert("Німецька мова");
        break;
    case country == "France":
        alert("Французька");
        break;

    default:
        alert("Вказаної країни немає в списку")
        break;
}

/* Завдання 4:
За допомогою цикла for виведіть всі числа котрі НЕ діляться на 6 між 0 и 100
*/

let result;

for (let i = 0; i <= 100; i++) {
    if (i % 6 !== 0) {
        console.log(i);
    }
}


/* Завдання 5:
Створіть функцію max(a, b), яка повертає більшее число з чисел а и b без використання бібліотеки Math
*/

function max(a, b) {
    if (a > b) {
        return a;
    } else {
        return b;
    }
}

console.log(max(2,5));